const motivationMessages = [
  'تمام كده… عضلاتك سجلت حضور 😎💪',
  'إنت النهارده كسبت الجولة ضد الكسل 🥊',
  'البروتين دلوقتي بيشتغل على طلبك 🧬💪',
  'إنت كده رسميًا مش "lazy" النهارده 👏',
  'تمرينك اتسجل… والدهون بتعيط في الزاوية 😆',
  'استمر كده وهتخلي المراية تقول واو 😎',

  'تم تسجيل التمرين 💪',
  'تمرينك اتسجل بنجاح 👌',
  'خطوة صغيرة… بس في الاتجاه الصح 💪',
  'أحسنت… مفيش كسل النهارده 😏',
  'تم… والراحة تستناك بعدين 😄',
  'اشتغلت على نفسك النهارده 👏',
  'كده نقدر نقول يوم ناجح 💪',
  'تم التسجيل… كمل كده 🔥',
  'أيوه كده، حركة مش كلام 😎'
];